import random
import task1_calc_sum_diff
import task2_calc_sum_list_items
import task3_variable_length_args
import task4_employee_data
import task5_sum_digits_of_number

# Task 1:
# Напишите функцию calculations () так, чтобы она могла
# принимать две переменные и вычислять их сложение и
# вычитание. А также он должен возвращать как сложение, так
# и вычитание за один вызов возврата.
# print('Task 1: Calculate sum and diff of 2 random values:')
# test_value_1 = random.randrange(10)
# test_value_2 = random.randrange(10)
# print(f'Value 1 = {test_value_1}, value 2 = {test_value_2}')
# sum_test, diff_test = task1_calc_sum_diff.calculations(test_value_1, test_value_2)
# print(f'Sum = {sum_test}\nDiff = {diff_test}')
#
# # Task 2:
# # Напишите функцию Python для суммирования всех чисел в списке.
# print('\nTask 2: Calculate sum of list items:')
# task2_calc_sum_list_items.print_calc_sum_list_result()
#
# # Task 3:
# # Напишите функцию func () так, чтобы она могла принимать
# # аргументы переменной длины и выводить все значения
# # аргументов с индексом аргумента.
# print('\nTask 3: Calculate sum of list items:')
# task3_variable_length_args.variable_length_func(5, 6, 7, 'Hello')
#
# # Task 4:
# # Создайте функцию showEmployee () таким образом, чтобы она
# # принимала имя сотрудника и его зарплату и отображала и то, и
# # другое. Если в вызове функции отсутствует зарплата, присвойте
# # зарплате значение по умолчанию 9000.
# print('\nTask 4: Print employee name and salary:')
# task4_employee_data.print_employee_data(name='Petro', salary=5000)
# task4_employee_data.print_employee_data(name='Ivan')

# Task 5:
# Дано натуральное число N. Вычислите сумму его цифр.
# Напишите рекурсивную функцию
print('\nTask 5: Sum digits of the natural number:')
task5_sum_digits_of_number.print_sum_digits_number()
