import random
import task1_calc_sum_diff
import task2_calc_sum_list_items

# Task 1:
# Напишите функцию calculations () так, чтобы она могла
# принимать две переменные и вычислять их сложение и
# вычитание. А также он должен возвращать как сложение, так
# и вычитание за один вызов возврата.
# print('Task 1: Calculate sum and diff of 2 random values:')
# test_value_1 = random.randrange(10)
# test_value_2 = random.randrange(10)
# print(f'Value 1 = {test_value_1}, value 2 = {test_value_2}')
# sum_test, diff_test = task1_calc_sum_diff.calculations(test_value_1, test_value_2)
# print(f'Sum = {sum_test}\nDiff = {diff_test}')

# Task 2:
# Напишите функцию Python для суммирования всех чисел в списке.
print('\nTask 2: Calculate sum of list items:')
task2_calc_sum_list_items.print_calc_sum_list_result()